package 자바기본문법;
/*
 *	주석 처리 => 번역이 안되는 부분
 *	1. 대소문자 구분
 *	2. 명령문 => CPU에 명령을 내려서 수행
 *	   ----- 문장 종료 => ;
 *	   | 명령 => 순서 (알고리즘) => 순서도
 *	3. 자바파일 저장 => (클래스명과 동일).java
 *	   class A => A.java
 *	   => 웹에서는 한글로 사용하면 안된다
 *		  %EC%9E%90%EB%B0%94 : 자바
 *	   => 운영체제가 변경이 되면 한글 사용이 불가능
 *		  ------ CI/CD => 우분투(리눅스) : AWS
 *	4. 자바 공부
 *	   기본 : 교재
 *		--------
 *	   ***1) 변수 => 데이터형 Chapter02
 *	   ***2) 연산자 => Chapter03
 *	   ***3) 제어문 => Chapter04
 *		  ***조건문 / 반복문
 *		  형식,문법사항 
 *	   4) 객체지향 프로그램 => Chapter05
 *		  | 클래스 / 객체 / 상속 / 캡슐화 / 다형성 => 5~7
 *
 *	   5) 인터페이스 / 내부 클래스 => 8~9
 *		  개념
 *	   6) 라이브러리 : 이미 만들어져 있는 클래스를 사용 (10)
 *	   7) 예외처리 : 에러방지 => 11
 *		  암기 /사용처 
 *	   -------------------------------------------
 *	   12장 / 13장 / 15장 / 16~17약간 / 18장 / 19(흐름)
 *	   20장 => 데이터베이스 연동 (핵심) => 수료 
 *	   --------------------
 *
 *	   독립적
 *	   오라클 연동 자바
 *	   웹에서 브라우저로 결과값 전송 => 웹
 *	   
 *	   => 문법 => 카페
 *	   => 소스 => GIT
 *
 *	   
 *
 *
 *
 *
 *	   
 *
 */
import java.util.*;
public class 기본문법 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//System.out.println(Arrays.toString("자바".getBytes()));
	}

}
