package 자바기본문법;
/*
 * 	 자바에서 데이터 표현법
 * 	 ----------------
 * 	 자바의 역사
 * 	 ---------
 * 	 1. 자바는 게임기에 들어가는 프로그램 (세븐스타) => 오크
 * 	 	=> 듀크
 * 		=> 임베디드 : 모바일 프로그램 (J2ME)
 * 	 2. 통합리모콘 : 그린 프로젝트
 * 		  | 파산 (후원사가 없다)
 * 	 3. 네스케이프에서 인수
 * 		------- 브라우저 업체 ===> 웹 (J2EE)
 * 		| 개발자 => JavaScript
 * 	 4. 독립 => 1995 / 5 / 23 => 5월 23일 자바데이 (제임스 고슬링)
 * 											   -----------
 * 										   현존하는 최고의 프로그래머
 * 										   | 이직 => 구글
 * 													----
 * 													GO/AngularJS
 * 													   ---------
 * 													   |부팀장
 * 														-----
 * 														| VueJS
 * 		VueJS => vue / vuex / pinia 
 * 					   ------------- MVC
 * 	 5. 공식적으로 자바 탄생을 알린다
 * 				 ------- 제임스 고슬링 / 아서 벤 ...
 * 						 -- Ja			  -va => Java
 * 				 => 애플릿 (웹에서 실행)
 * 				 => 웹 : 정보 전달 (문자열) => 이미지,동영상
 * 	 6. 한국에 도착 : 1996년
 * 		----------------(X)
 * 	 7. 2000년 웹마스터 (상거래 : 전자상거래 => 5000개)
 * 		=> 자바교육 : 1개월 => 모든 인원 취업 
 * 		   삼성 : => 1개월 : 360만원 => JSP / Servle
 * 	 8. 자바 : 언어 / 운영체제(솔라리스) / 데이터베이스
 * 										|
 * 									   MySQL인수 => 부도
 * 	 9. 인수 => 오라클 => 불만 (제임스 고슬링)
 * 							------------ 구글
 * 	 10. 오라클 => 자바를 유료화 : 오픈 소스 (openjdk)
 * 		 ------------------
 * 		 | 자바대체 : Kotlin
 * 	 => 자바
 * 		1. 웹 개발
 * 		2. 모바일 => andorid
 * 		
 * 		================
 * 		   J2SE ==> 표준 자바
 * 		================
 * 		   J2EE ==> 웹
 * 		================
 * 		   J2ME ==> 모바일 ===> 오라클에서 모바일에 첨부 자바는 유료
 * 					=> 코틀린이 대체 / 플루터 (Dart)
 * 		================
 * 
 * 		=> 핸드폰
 * 		   안드로이드 운영체제
 * 		   --------------- => 삼성 => 구글 
 * 		   | => 바다 (x)
 * 		   | => 티맥스 => 운영체제 (x) => 티맥스(x)
 * 		   | =>			 ------> 삼성
 * 		   -----------------------------------
 * 		   삼성 = 애플
 * 			   |
 * 			  ms => 핸드폰 1개당 20달러
 * 			  --
 * 		   AI / 임베디드 ...
 * 
 * 		=> 자바의 단점
 * 		   exe => .class => 그냥 실행이 가능 (브라우저)
 * 		   --- jar
 * 		   => 윈도우 : swing / javaFx
 * 							 ------- 브라우저 실행
 * 	  => CBD (이미 기능이 만들어져 있다)
 * 		 자바 => 조립식 =>	  객체지향
 * 				 | 도구 => 컴포넌트 => class : 재사용 / 수정 / 추가
 * 				 C / C++
 * 					  --- 한개 증가
 * 					  C With class
 * 
 * 
 */
public class 자바기초 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
